/*******************************************************************************
 *               ╔══╗╔══╗╔╗──╔╗╔══╗╔══╗╔╗──╔╗───╔══╗╔════╗╔╗──   (c)26.05.2025 *
 *               ║╔═╝╚╗╔╝║║──║║║╔═╝║╔╗║║║──║║───║╔╗║╚═╗╔═╝║║──       v1.0.0    *
 *               ║╚═╗─║║─║╚╗╔╝║║║──║║║║║╚╗╔╝║───║╚╝║──║║──║║──                 *
 *               ╚═╗║─║║─║╔╗╔╗║║║──║║║║║╔╗╔╗║───║╔╗║──║║──║║──                 *
 *               ╔═╝║╔╝╚╗║║╚╝║║║╚═╗║╚╝║║║╚╝║║───║║║║──║║──║╚═╗                 *
 *               ╚══╝╚══╝╚╝──╚╝╚══╝╚══╝╚╝──╚╝───╚╝╚╝──╚╝──╚══╝                 *  
 ******************************************************************************/
/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "atl_modem.h"
#include "atl_modem_cmd.h"

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/*******************************************************************************
 * Local types definitions
 ******************************************************************************/
/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/*******************************************************************************
 ** \brief  Function to init GSM module at the start. Usually no need to use this
 ** \param  cpin        - pin code for SIM card if needed. Could be NULL.
 ** \param  p_result_cb - callback for the end of this process.
 ** \retval bool
 ******************************************************************************/
bool atl_gsm_init(const uint8_t* cpin, const atl_cmd_fun_rsp_cb p_result_cb)
{
  bool result = false;
  atl_cmd_entity_t at_cmd_init[] =
  {
    {"AT"ATL_CMD_END,         4, NULL},
    {"AT"ATL_CMD_END,         4, NULL},
    {ATL_CMD_DELAY"2000",    10, NULL},
    {"AT+CPIN?"ATL_CMD_END,  10, atl_cmd_proc_gsm_init_cpin},
    {"AT+CPIN=",              0, NULL},
    {ATL_CMD_DELAY"3000",    10, NULL},
    {"AT+CREG?"ATL_CMD_END,  10, atl_cmd_proc_gsm_init_creg},
    {ATL_CMD_DELAY"2000",    10, NULL},
    {"AT+CGATT?"ATL_CMD_END, 11, atl_cmd_proc_gsm_init_cgatt},
  };
  uint8_t p_at_cpin[15] = {0};
  sprintf(p_at_cpin,"AT+CPIN=%s%s", cpin, ATL_CMD_END);
  at_cmd_init[4].request = p_at_cpin;
  at_cmd_init[4].cmd_len = strlen(p_at_cpin);
  result = atl_cmd_queue_fun_append(at_cmd_init, sizeof(at_cmd_init) /sizeof(at_cmd_init[0]), p_result_cb);
  return result;
}

/*******************************************************************************
 ** \brief  Function to restart GSM module with full functionality
 ** \param  p_result_cb - callback for the end of this process.
 ** \retval bool
 ******************************************************************************/
bool atl_gsm_restart(const atl_cmd_fun_rsp_cb p_result_cb)
{
  bool result = false;
  atl_cmd_entity_t at_cmd_init[] = {{"AT+CFUN=1,1"ATL_CMD_END, 13, NULL},};
  result = atl_cmd_queue_fun_append(at_cmd_init, sizeof(at_cmd_init) /sizeof(at_cmd_init[0]), p_result_cb);
  return result;
}