/*******************************************************************************
 *               ╔══╗╔══╗╔╗──╔╗╔══╗╔══╗╔╗──╔╗───╔══╗╔════╗╔╗──   (c)26.05.2025 *
 *               ║╔═╝╚╗╔╝║║──║║║╔═╝║╔╗║║║──║║───║╔╗║╚═╗╔═╝║║──       v1.0.0    *
 *               ║╚═╗─║║─║╚╗╔╝║║║──║║║║║╚╗╔╝║───║╚╝║──║║──║║──                 *
 *               ╚═╗║─║║─║╔╗╔╗║║║──║║║║║╔╗╔╗║───║╔╗║──║║──║║──                 *
 *               ╔═╝║╔╝╚╗║║╚╝║║║╚═╗║╚╝║║║╚╝║║───║║║║──║║──║╚═╗                 *
 *               ╚══╝╚══╝╚╝──╚╝╚══╝╚══╝╚╝──╚╝───╚╝╚╝──╚╝──╚══╝                 *  
 ******************************************************************************/
#ifndef __ATL_MDL_GENERAL_IMPL_H
#define __ATL_MDL_GENERAL_IMPL_H

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <stdint.h> 
#include <stdbool.h> 
#include <string.h>

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/*******************************************************************************
 * Local types definitions
 ******************************************************************************/
typedef void (*atl_rtd_cb_t)(bool result, atl_mdl_rtd_t* rtd); //at cmd group callback type

typedef struct modem_lbs_t {
  int cell;
  int mcc;
  int mnc;
  int lac;
  int cell_id;
} atl_mdl_rtd_lbs_t;

typedef struct atl_mdl_rtd_t {
  char modem_imei[16];  
  char modem_id[16];     
  char modem_rev[30];     
  char modem_clock[22];
  char sim_iccid[22];
  char sim_operator[50];
  int sim_rssi;
  atl_mdl_rtd_lbs_t modem_lbs[7];
  int lbs_cnt;
} atl_mdl_rtd_t;

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/*******************************************************************************
 ** \brief  Function to restart the modem
 ** \param  cb  cb when proc will be done
 ** \retval true - proc started, false - smthg is wrong
 ******************************************************************************/
bool atl_mdl_modem_reset(atl_entity_cb_t cb);

/*******************************************************************************
 ** \brief  Function to init modem
 ** \param  cb  cb when proc will be done
 ** \retval true - proc started, false - smthg is wrong
 ******************************************************************************/
bool atl_mdl_modem_init(atl_entity_cb_t cb);

/*******************************************************************************
 ** \brief  Function to get real time data info about modem. This function
 **         creates an instance of @atl_mdl_rtd_t in atl heap and then pass
 **         that instance to your callback. When callback execution will be done 
 **         instance will be free, so if you need that for longer time just
 **         do copy.
 ** \param  cb  cb when proc will be done. 
 ** \retval true - proc started, false - smthg is wrong
 ******************************************************************************/
bool atl_mdl_rtd(atl_rtd_cb_t cb);

 #endif //__ATL_MDL_GENERAL_IMPL_H 